Revit 2027 API
BuiltInFailures.RegenFailures.CircularDependencySketch Property
 Constraints in sketches of highlighted elements cause a circular chain of references.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CircularDependencySketch { get; }
Public Shared ReadOnly Property CircularDependencySketch As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CircularDependencySketch {
	FailureDefinitionId^ get ();
}
static member CircularDependencySketch : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RegenFailures Class
Autodesk.Revit.DB Namespace